{
  "professional_experience": [
    {
      "id": 1,
      "date": "August 2024 - Present",
      "title": "Professional Services (Cloud Consultant) - DevOps/MLOps",
      "position": "Full-time",
      "company": "Amazon Web Services",
      "location": "Hyderabad, India",
      "summary": "As a Professional Services Consultant, I help enterprise customers architect, migrate, and build scalable solutions on AWS with infrastructure automation and MLOps best practices.",
      "projects": [
        {
          "name": "DevOps Infrastructure Automation - State Street",
          "description": {
            "1": "Developed and maintained reusable Terraform modules for core AWS services (EventBridge, CloudWatch, SNS, EBS, Detective), reducing infrastructure deployment time by up to 80% across 38+ enabled services.",
            "2": "Implemented comprehensive unit testing framework using tftest to validate Terraform modules, achieving high deployment confidence and infrastructure reliability.",
            "3": "Designed and delivered technical specifications enforcing enterprise security hardening guidelines with 1000+ preventative controls, reducing compliance audit overhead.",
            "4": "Achieved 10/10 CSAT score through close stakeholder collaboration, translating business requirements into scalable infrastructure solutions."
          },
          "skills": [
            "AWS",
            "EventBridge",
            "CloudWatch",
            "SNS",
            "EBS",
            "Detective",
            "Terraform",
            "tftest",
            "Security Hardening"
          ]
        },
        {
          "name": "DevSecOps Infrastructure Automation - DTCC",
          "description": {
            "1": "Refactored and created Terraform infrastructure modules to modernize legacy systems for cloud-native transformation in financial services.",
            "2": "Integrated Amazon Q AI capabilities to accelerate code analysis, documentation, and migration assessments across the engagement."
          },
          "skills": ["AWS", "Terraform", "Amazon Q", "CloudFormation", "DevSecOps", "Cloud Migration"]
        },
        {
          "name": "Medical Image Classification MLOps Pipeline - ProServe MLOps SME",
          "description": {
            "1": "Architected an end-to-end MLOps pipeline on AWS SageMaker, automating data processing, multi-model training, and ensemble model creation.",
            "2": "Implemented production-ready SageMaker endpoints with blue-green deployment, auto-scaling, and real-time monitoring for drift detection, providing zero-downtime model updates and automatic rollback capabilities.",
            "3": "Utilized Terraform for infrastructure provisioning and built CI/CD pipelines using AWS CodePipeline and CodeBuild to deploy the entire system, including a CloudFront front-end and a scalable API Gateway + Lambda inference API."
          },
          "skills": [
            "AWS",
            "SageMaker",
            "CloudWatch",
            "Lambda",
            "API Gateway",
            "EventBridge",
            "CodePipeline",
            "CloudFront",
            "Terraform",
            "Python"
          ]
        }
      ]
    },
    {
      "id": 2,
      "date": "March 2024 - July 2024",
      "title": "Associate Professional Services - DevOps",
      "position": "Internship",
      "company": "Amazon Web Services",
      "location": "Hyderabad, India",
      "summary": "Underwent extensive hands-on DevOps and Cloud training, delivered multiple proof-of-concepts, and contributed to a production ECS migration project using Terraform and CI/CD pipelines.",
      "project": "ECS Application Deployment with Terraform",
      "description": {
        "1": "Led migration of on-premises web application to AWS ECS, implementing high-availability architecture and CI/CD pipeline using AWS CodePipeline, reducing maintenance overhead.",
        "2": "Architected infrastructure as code using Terraform, managing AWS resources including VPC, ALB, and ECS clusters while implementing blue-green deployment strategy for zero-downtime updates.",
        "3": "Automated Docker image building and deployment process through integration of AWS CodeBuild, CodeDeploy, and Amazon ECR, streamlining application delivery workflow.",
        "4": "Established comprehensive monitoring solution using AWS X-Ray and CloudWatch for distributed tracing and full observability of application performance."
      },
      "skills": [
        "AWS",
        "ECS",
        "CodePipeline",
        "ECR",
        "X-Ray",
        "CloudWatch",
        "Terraform",
        "Docker",
        "Git",
        "CodeBuild",
        "CodeDeploy",
        "VPC",
        "ALB",
        "Blue-Green Deployment"
      ]
    },
    {
      "id": 3,
      "date": "May 2023 - July 2023",
      "title": "Software Developer Associate",
      "position": "Internship",
      "company": "Ikarus-3D",
      "location": "Mohali, India",
      "summary": "Gained hands-on exposure to containerization, CI/CD practices, and code quality tooling while contributing to production deployment workflows on AWS.",
      "project": "Web Application Containerization and Deployment",
      "description": {
        "1": "Led containerization of application with Docker and orchestrated deployment to AWS using ECR and ECS services.",
        "2": "Implemented comprehensive CI/CD pipeline using GitHub Actions, automating linting, testing, building, and deployment processes.",
        "3": "Standardized codebase with multi-language linting (pylint, flake8, Black, ESLint, Stylelint) and unit testing (Pytest, Jest).",
        "4": "Deployed SonarQube on AWS EC2 with RDS integration for continuous code quality analysis.",
        "5": "Provisioned Forem platform using Ansible for streamlined infrastructure automation."
      },
      "skills": [
        "AWS",
        "EC2",
        "ECR",
        "ECS",
        "RDS",
        "Docker",
        "GitHub Actions",
        "SonarQube",
        "Ansible",
        "Python",
        "JavaScript",
        "CI/CD"
      ]
    }
  ],
  "positions_of_responsibility": [
    {
      "id": 1,
      "date": "August 2023 - June 2024",
      "title": "Additional Secretary",
      "position": "",
      "company": "CSEA, NIT Warangal",
      "location": "Warangal, Telangana",
      "summary": "Part of the largest student body on campus, creating opportunities for students to learn, grow, and have fun.",
      "description": {
        "1": "Member of the Contest Team, organizing competitive programming events and coding challenges.",
        "2": "Member of the Development Team, building and maintaining web applications for the club."
      },
      "skills": ["Communication", "Leadership", "Teamwork", "Management", "Git", "GitHub", "React", "Nodejs"]
    },
    {
      "id": 2,
      "date": "August 2023 - June 2024",
      "title": "Class Representative",
      "position": "",
      "company": "MCA Final Year, NIT Warangal",
      "location": "Warangal, Telangana",
      "summary": "Facilitated student-faculty communication and managed class operations for MCA Final Year.",
      "description": {
        "1": "Facilitate effective communication between students and faculty, representing the class in meetings.",
        "2": "Collaborate with class representatives to address student concerns and enhance the learning environment."
      },
      "skills": ["Communication", "Leadership", "Teamwork", "Management"]
    }
  ]
}
